"""
杨辉三角定义如下：

          1
         / \
        1   1
       / \ / \
      1   2   1
     / \ / \ / \
    1   3   3   1
   / \ / \ / \ / \
  1   4   6   4   1
 / \ / \ / \ / \ / \
1   5   10  10  5   1
把每一行看做一个list，试写一个generator，不断输出下一行的list：
"""
def triangles():
    # 每行第一个元素和最后一个元素都是1
    # 初始化第一行
    row = [1]
    while True:
        yield row
        # 定义存放下一行元素的列表,第一位是1
        next_row = [1]
        # 杨辉三角形要生成第二行时，len(row)=1，range(len(row)-1)=range(0),不会执行循环
        for i in range(len(row)-1):
            # 新的一行是的第二个元素由上一行的第一个元素+第二个元素生成的，第三个。。。
            next_row.append(row[i] + row[i+1])
        #  最后一位也是1
        next_row.append(1)
        row = next_row
# 注意：生成器函数在被调用时并不会立即执行函数体内的代码，而是返回一个生成器对象，只有在迭代这个生成器对象时，函数体内的代码才会执行
# print(triangles()) # 是不会执行函数代码的

# 更简洁的方式是：
# def triangles():
#     # 每行第一个元素和最后一个元素都是1
#     # 初始化第一行
#     row = [1]
#     while True:
#         yield row
#         row = [1] + [row[i]+row[i+1] for i in range(len(row)-1)] + [1]

# 期待输出:
# [1]
# [1, 1]
# [1, 2, 1]
# [1, 3, 3, 1]
# [1, 4, 6, 4, 1]
# [1, 5, 10, 10, 5, 1]
# [1, 6, 15, 20, 15, 6, 1]
# [1, 7, 21, 35, 35, 21, 7, 1]
# [1, 8, 28, 56, 70, 56, 28, 8, 1]
# [1, 9, 36, 84, 126, 126, 84, 36, 9, 1]
n = 0
results = []
for t in triangles():
    results.append(t)
    n = n + 1
    if n == 10:
        break

for t in results:
    print(t)

if results == [
    [1],
    [1, 1],
    [1, 2, 1],
    [1, 3, 3, 1],
    [1, 4, 6, 4, 1],
    [1, 5, 10, 10, 5, 1],
    [1, 6, 15, 20, 15, 6, 1],
    [1, 7, 21, 35, 35, 21, 7, 1],
    [1, 8, 28, 56, 70, 56, 28, 8, 1],
    [1, 9, 36, 84, 126, 126, 84, 36, 9, 1]
]:
    print('测试通过!')
else:
    print('测试失败!')
